<?php

namespace Database\Seeders;

use App\Models\Client;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ClientSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $clients = [
            'احمد المحمدي',
            'احمد جابر',
            'احمد جمال',
            'احمد حافظ',
            'احمد راشد',
            'احمد صادق',
            'اراتکو',
            'اسامه سعيد',
            'اسلام سعد',
            'الاحمدي',
            'الاسكا',
            'الراية',
            'السويدي',
            'المعداوي',
            'اوندا',
            'ایجی کیر',
            'ایمن صلاح',
            'ایه اندام ( دواء )',
            'باركو مصر',
            'بيور المستحضرات التجميل',
            'جواد',
            'جون بهيج',
            'جون ماهر',
            'حاتم طنطا',
            'حسام احمد',
            'حسن',
            'خالد النجار',
            'دابل اند فارم',
            'دوا ايجيبت',
            'دواء',
            'سالی',
            'صلاح',
            'ضياء',
            'طلبات',
            'طلعت توريدات',
            'عرابي للمناديل',
            'غطاطی',
            'فلكسوبرنت',
            'كيان',
            'اليبيل تك',
            'مؤمن ياسر',
            'مالتی اینسیت',
            'محمد أبو المجد',
            'محمد السعيد ليبيا',
            'محمد السيد',
            'محمد حسن',
            'محمد زکی',
            'محمد موسى',
            'محمود القصاص',
            'محمود بداية',
            'مزارع دينا',
            'مصطفى ابو العلا',
            'مصطفى جابر',
            'مصطفى حماد',
            'منتصر حسن',
            'مهرانكو',
            'نونو',
            'نیوترا مید',
            'هانی عزمی',
            'ياسر السوري',
            'یوسف رومانی',
            'يونيون فارما',
        ];

        foreach ($clients as $clientName) {
            Client::firstOrCreate(
                ['name' => $clientName],
                ['name' => $clientName]
            );
        }
    }
}
